{
    "basic_info": {
      "description_header": "Hi",
      "description": "👋 Hi there, I'm Xin. I graduated college with an environmental science degree and realized too late that I didn’t like spending the majority of my time writing research papers and because I needed time to rethink my career, the first job I took out of college was working as a receptionist at a vet clinic. Where I realized I actually had a knack for team leadership and problem solving when I moved to a lead position and the first thing I did was create a training guide for new hires because I wanted to set others up for success in a less stressful way that I experienced. But, I needed a more fulfilling career and so I went to a coding school where I saw how creative tech can be. It’s a great balance of art and stem which I love so I’m ready to channel that passion into any project",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
     
      {
        "title": "Quick Lab",
        "startDate": "2024",
        "description": "A user-friendly system that streamlines the setup process for lab assignments, ensuring that students can focus on learning rather than the intricacies of environment configuration. By automating the environment setup, we aim to create a seamless, error-free process that adapts to various operating systems and Python versions, guaranteeing that every participant starts from a standardized, fully-prepared platform. This project enhanced the efficiency and accessibility of labs but also foster a more inclusive and engaging learning experience by removing technical barriers and allowing students to dive straight into coding.",
        "images": [
          "images/portfolio/401-mid/p1.jpg",
          "images/portfolio/401-mid/p2.jpg"
        ],
        "url": "https://github.com/Pawgrammers-Collective/quick-lab",
        "technologies": [
          {
            "class": "devicon-python-plain",
            "name": "Python"
          }
        ]
      },
      {
        "title": "Job.fetch()",
        "startDate": "2023",
        "description": "The project is a comprehensive tech career preparation and job search engine that integrates job search functionalities, resume building, interview preparation, and career coaching features. Leveraging AI, the platform generates interview questions and cover letters based on job descriptions and uploaded resumes. This all-in-one solution aims to streamline the tech job search process, enhance candidate preparation, and provide personalized career coaching.",
        "images": [
          "images/portfolio/301-final/p1.jpg",
          "images/portfolio/301-final/p2.jpg"
        ],
        "url": "https://github.com/Pawgrammers-Collective/job.fetch-frontend",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-nodejs-plain",
            "name": "NodeJS"
          },
          {
            "class": "devicon-mongodb-plain",
            "name": "MongoDB"
          }
        ]
      },
      {
        "title": "Cocktail Generator",
        "startDate": "2023",
        "description": "A digital bartender that will guide you to crafting the perfect cocktail. Choose a base spirit, plus additional ingredients and your bartender will present you with a recipe to help you create a tasty drink.",
        "images": [
          "images/portfolio/201-final/p1.jpg",
          "images/portfolio/201-final/p2.jpg"
        ],
        "url": "https://github.com/XBJ-Software-Solutions/XBJ-Cocktail-Generator",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "Javascript"
          },
          {
            "class": "devicon-html5-plain",
            "name": "HTML"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "Code Fellows",
        "title": "Software Developer Student",
        "years": "10.2023 - 03.2024",
        "mainTech": [
          "JavScript",
          "Python"
        ],
        "technologies": [
          "HTML",
          "CSS",
          "JavaScript",
          "Bootstrap",
          "React",
          "GitHub",
          "Git"
        
        ]
      },
      {
        "company": "CPC",
        "title": "Program Lead",
        "years": "05.2021 - 05.2023",
        "mainTech": [
          "Team Management"
        ],
        "technologies": [
          "Team Development",
          "Cross-team Collaboration",
          "Role Training"
       
        ]
      }
    ]
  }
